# St7GetBeamDistributedForcePrincipal6ID

Returns distributed load data assigned to the specified beam element. The force is applied according to the
principal axis system of the beam. See also St7GetEntityAttributeSequenceCount and
St7GetEntityAttributeSequence.

long St7GetBeamDistributedForcePrincipal6ID(long uID, long BeamNum, long BeamDir,
long CaseNum, long ID, long* DLType, double* Doubles)
Input Parameters
uID
Strand7 model file ID.
BeamNum
Beam number.
BeamDir
Principal or local axis direction. Principal directions are denoted as 1, 2 or 3; local directions are
denoted as either 4 (local x) or 5 (local y); see Beam Local Coordinates.
CaseNum
Load case number.
ID
Distributed load ID.
Output Parameters
DLType
One of dlConstant, dlLinear, dlTriangular, dlThreePoint0, dlThreePoint1 or dlTrapezoidal.
Doubles[0..5]
A 6-element array describing the distributed load. See Beam Distributed Load Types for additional
information.